MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFG124/mcu.h
#define _NVMCON_PROGOP_POSITION                  0x00000000
#define _NVMCON_PROGOP_MASK                      0x0000000F
#define _NVMCON_PROGOP_LENGTH                    0x00000004

#define _NVMCON_PROGOP0_POSITION                 0x00000000
#define _NVMCON_PROGOP0_MASK                     0x00000001
#define _NVMCON_PROGOP0_LENGTH                   0x00000001

#define _NVMCON_PROGOP1_POSITION                 0x00000001
#define _NVMCON_PROGOP1_MASK                     0x00000002
#define _NVMCON_PROGOP1_LENGTH                   0x00000001

#define _NVMCON_PROGOP2_POSITION                 0x00000002
#define _NVMCON_PROGOP2_MASK                     0x00000004
#define _NVMCON_PROGOP2_LENGTH                   0x00000001

#define _NVMCON_PROGOP3_POSITION                 0x00000003
#define _NVMCON_PROGOP3_MASK                     0x00000008
#define _NVMCON_PROGOP3_LENGTH                   0x00000001

#define _NVMCON_w_POSITION                       0x00000000
#define _NVMCON_w_MASK                           0xFFFFFFFF
#define _NVMCON_w_LENGTH                         0x00000020

#define _NVMPWP_PWP_POSITION                     0x00000000
#define _NVMPWP_PWP_MASK                         0x00FFFFFF
#define _NVMPWP_PWP_LENGTH                       0x00000018

#define _NVMPWP_PWPULOCK_POSITION                0x0000001F
#define _NVMPWP_PWPULOCK_MASK                    0x80000000
#define _NVMPWP_PWPULOCK_LENGTH                  0x00000001

#define _NVMBWP_UBWP0_POSITION                   0x00000000
#define _NVMBWP_UBWP0_MASK                       0x00000001
#define _NVMBWP_UBWP0_LENGTH                     0x00000001

#define _NVMBWP_UBWP1_POSITION                   0x00000001
#define _NVMBWP_UBWP1_MASK                       0x00000002
#define _NVMBWP_UBWP1_LENGTH                     0x00000001

#define _NVMBWP_UBWP2_POSITION                   0x00000002
#define _NVMBWP_UBWP2_MASK                       0x00000004
#define _NVMBWP_UBWP2_LENGTH                     0x00000001

#define _NVMBWP_UBWP3_POSITION                   0x00000003
#define _NVMBWP_UBWP3_MASK                       0x00000008
#define _NVMBWP_UBWP3_LENGTH                     0x00000001

#define _NVMBWP_UBWP4_POSITION                   0x00000004
#define _NVMBWP_UBWP4_MASK                       0x00000010
#define _NVMBWP_UBWP4_LENGTH                     0x00000001

#define _NVMBWP_UBWPULOCK_POSITION               0x00000007
#define _NVMBWP_UBWPULOCK_MASK                   0x00000080
#define _NVMBWP_UBWPULOCK_LENGTH                 0x00000001

#define _NVMBWP_LBWP0_POSITION                   0x00000008
#define _NVMBWP_LBWP0_MASK                       0x00000100
#define _NVMBWP_LBWP0_LENGTH                     0x00000001

#define _NVMBWP_LBWP1_POSITION                   0x00000009
#define _NVMBWP_LBWP1_MASK                       0x00000200
#define _NVMBWP_LBWP1_LENGTH                     0x00000001

#define _NVMBWP_LBWP2_POSITION                   0x0000000A
#define _NVMBWP_LBWP2_MASK                       0x00000400
#define _NVMBWP_LBWP2_LENGTH                     0x00000001

#define _NVMBWP_LBWP3_POSITION                   0x0000000B
#define _NVMBWP_LBWP3_MASK                       0x00000800
#define _NVMBWP_LBWP3_LENGTH                     0x00000001

#define _NVMBWP_LBWP4_POSITION                   0x0000000C
#define _NVMBWP_LBWP4_MASK                       0x00001000
#define _NVMBWP_LBWP4_LENGTH                     0x00000001

#define _NVMBWP_LBWPULOCK_POSITION               0x0000000F
#define _NVMBWP_LBWPULOCK_MASK                   0x00008000
#define _NVMBWP_LBWPULOCK_LENGTH                 0x00000001

#define _NVMCON2_SWAPLOCK_POSITION               0x00000006
#define _NVMCON2_SWAPLOCK_MASK                   0x000000C0
#define _NVMCON2_SWAPLOCK_LENGTH                 0x00000002

#define _WDTCON_WDTWINEN_POSITION                0x00000000
#define _WDTCON_WDTWINEN_MASK                    0x00000001
#define _WDTCON_WDTWINEN_LENGTH                  0x00000001

#define _WDTCON_RUNDIV_POSITION                  0x00000008
#define _WDTCON_RUNDIV_MASK                      0x00001F00
#define _WDTCON_RUNDIV_LENGTH                    0x00000005

#define _WDTCON_ON_POSITION                      0x0000000F
#define _WDTCON_ON_MASK                          0x00008000
#define _WDTCON_ON_LENGTH                        0x00000001

#define _WDTCON_WDTCLRKEY_POSITION               0x00000010
#define _WDTCON_WDTCLRKEY_MASK                   0xFFFF0000
#define _WDTCON_WDTCLRKEY_LENGTH                 0x00000010

#define _DMTCON_ON_POSITION                      0x0000000F
#define _DMTCON_ON_MASK                          0x00008000
#define _DMTCON_ON_LENGTH                        0x00000001

#define _DMTPRECLR_STEP1_POSITION                0x00000008
#define _DMTPRECLR_STEP1_MASK                    0x0000FF00
#define _DMTPRECLR_STEP1_LENGTH                  0x00000008

#define _DMTCLR_STEP2_POSITION                   0x00000000
#define _DMTCLR_STEP2_MASK                       0x000000FF
#define _DMTCLR_STEP2_LENGTH                     0x00000008

#define _DMTSTAT_WINOPN_POSITION                 0x00000000
#define _DMTSTAT_WINOPN_MASK                     0x00000001
#define _DMTSTAT_WINOPN_LENGTH                   0x00000001

#define _DMTSTAT_DMTEVENT_POSITION               0x00000005
#define _DMTSTAT_DMTEVENT_MASK                   0x00000020
#define _DMTSTAT_DMTEVENT_LENGTH                 0x00000001

#define _DMTSTAT_BAD_POSITION                    0x00000006
#define _DMTSTAT_BAD_MASK                        0x000000C0
#define _DMTSTAT_BAD_LENGTH                      0x00000002

#define _DMTSTAT_BAD2_POSITION                   0x00000006
#define _DMTSTAT_BAD2_MASK                       0x00000040
#define _DMTSTAT_BAD2_LENGTH                     0x00000001

#define _DMTSTAT_BAD1_POSITION                   0x00000007
#define _DMTSTAT_BAD1_MASK                       0x00000080
#define _DMTSTAT_BAD1_LENGTH                     0x00000001

#define _DMTSTAT_w_POSITION                      0x00000000
#define _DMTSTAT_w_MASK                          0xFFFFFFFF
#define _DMTSTAT_w_LENGTH                        0x00000020

#define _DMTCNT_COUNTER_POSITION                 0x00000000
#define _DMTCNT_COUNTER_MASK                     0xFFFFFFFF
#define _DMTCNT_COUNTER_LENGTH                   0x00000020

#define _DMTPSCNT_PSCNT_POSITION                 0x00000000
#define _DMTPSCNT_PSCNT_MASK                     0xFFFFFFFF
#define _DMTPSCNT_PSCNT_LENGTH                   0x00000020

#define _DMTPSINTV_PSINTV_POSITION               0x00000000
#define _DMTPSINTV_PSINTV_MASK                   0xFFFFFFFF
#define _DMTPSINTV_PSINTV_LENGTH                 0x00000020

